In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\AST\Desktop\мл\Lec_1\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
SEED = 10001205

In [6]:
df.Age.fillna(round(df.Age.median(),0), inplace = True)

In [7]:
df.dropna(subset=['Embarked'],inplace=True)

In [8]:
df.drop(['PassengerId', 'SibSp', 'Parch', 'Ticket', 'Name', 'Cabin'],axis=1,inplace = True)

In [9]:
df.tail()

     Survived  Pclass     Sex   Age   Fare Embarked
886         0       2    male  27.0  13.00        S
887         1       1  female  19.0  30.00        S
888         0       3  female  28.0  23.45        S
889         1       1    male  26.0  30.00        C
890         0       3    male  32.0   7.75        Q

In [16]:
df.loc[df.Sex=='male','Sex'] = 0
df.loc[df.Sex=='female','Sex'] = 1
df.loc[df.Embarked=='S','Embarked']=1
df.loc[df.Embarked=='C','Embarked']=2
df.loc[df.Embarked=='Q','Embarked']=3

In [17]:
from sklearn.model_selection import train_test_split

In [18]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('Age', axis=1),
                                                   df.Age,
                                                   test_size=0.3,
                                                   random_state = SEED
                                                   )

In [19]:
X_train.head()

     Survived  Pclass Sex      Fare Embarked
306         1       1   1  110.8833        2
124         0       1   0   77.2875        1
766         0       1   0   39.6000        2
99          0       2   0   26.0000        1
340         1       2   0   26.0000        1

In [20]:
from sklearn.linear_model import LinearRegression

In [21]:
lr = LinearRegression()

In [22]:
lr.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [23]:
pred = lr.predict(X_test)

In [24]:
from sklearn.metrics import mean_absolute_error

In [29]:
print('MAE на обучающей выборке', mean_absolute_error(y_train, lr.predict(X_train)))
print('MAE на тесте', mean_absolute_error(y_test, pred))

MAE на обучающей выборке 9.065463219860913
MAE на тесте 8.762861383471181

In [30]:
result = X_test

In [28]:
result['real'] = y_test
result['predict'] = pred
result[['real','predict']].to_excel('Age.xlsx')